{
    "locales": {
        "en": {
            "title": ""
        }
    },

    "subcategories": [
        {
            "id": "faq-behavioral",
            "locales": {
                "en": {"title": "Behavioral Questions"}
            }
        },
        {
            "id": "faq-technical",
            "locales": {
                "en": {"title": "Technical Questions"}
            }
        }
    ],

    "items": {
        "faq-behavioral": [
            {
                "id": "prioritization",
                "value": 0,
                "locales": {
                    "en": {
                        "title": "What specific strategies do you use to determine priority and ensure timely delivery?",
                        "description": "Here is how I worked through daily critical threat reporting in my last job:<ul><li>I received dumps of large volumes of data, the challenge was to parse that given personnel limitations.</li><li>So first I used specialized tools used to filter down to the best prospects using queries and transformations.</li><li>Next, I analyze and prioritize the data, using the Rule of Thumb that is 'one piece of evidence is weak, two pieces of evidence suggesting same thing is strong'</li><li>Then I use my subject matter expertise to fill in gaps or missing information based on previous experience, and to refine future queries and transformations.</li><li>Finally I produce and publish the reports for stakeholders to view.</li><li>Result: in my last assigned office was an increase in our report rate from 3 per week to 10 per week.</li></ul>"
                    }
                }
            },
            {
                "id": "collaboration",
                "value": 0,
                "locales": {
                    "en": {
                        "title": "Describe a time you had to collaborate as a team.",
                        "description": "At my last job, I was integrated with a cross-functional team spread across multiple remote locations in different timezones consisting of various analysts, inter-agency liaisons, and technical support staff:<ul><li>The team had daily standup meetings every morning to share critical status updates and address any individual blockers to develop an action plan for resolution.</li><li>The resolution typically involved either screensharing in remote meetings or in person meetings at the analysts' desk to work through the problem.</li><li>I also worked closely with partners at different locations around the country to do needs assessment through email, chat, teleconference, and in-person visits, which required planning around timezone differences.</li><li>I prepared briefings with PowerPoint, Excel, and visualization aids from various dashboards to communicate important findings to the team and our customers.</li><li>I also volunteered to mentor more junior teammates during a period of short-staffing after the departure of some key personnel.</li><li>I clearly documented my findings and shared these with teammates in collaboration spaces.</li><li>Result: improvement of customer relationship with partner agencies through positive written feedback, and notable mission success which elicited meritorious unit citation.</li></ul>"
                    }
                }
            },
            {
                "id": "requirements",
                "value": 0,
                "locales": {
                    "en": {
                        "title": "Can you tell us about your ability to interpret customer requests and translate these into action items?",
                        "description": "My last position required me to identify trends and make judgement calls based on limited available information using time-saving strategies to manage with limited resources:<ul><li>I was assigned to a newly-created cross-functional team working on special projects to identify gaps in critical threat reporting.</li><li>I was piloting the rollout of a new set of tools, which I used to identify a previously-unidentified source of actionable information.</li><li>Based on my prior relationship with and knowledge of our customers' needs, they trusted me when I approached them with this new data stream.</li><li>Result: authorities were given advanced notification and the team permanently shifted focus to this new data stream.</li></ul>"
                    }
                }
            },
            {
                "id": "leadership",
                "value": 0,
                "locales": {
                    "en": {
                        "title": "Describe a time when you took on a leadership role.",
                        "description": "I took ownership and lead several projects, becoming the primary point of contact who our customers reached out to:<ul><li>I stepped up and took on responsibility for mentoring newcomers to our team, bringing them up to speed on the tools we use so they could integrate more quickly into the team.</li><li>Teammates felt comfortable approaching me with questions because I am a friendly person and I encouraged them to do so.</li><li>My efforts led to increased visibility of the important work our team was doing.</li><li>Result: my desire to ensure team success allowed us to fulfill customer requirements and meet our team priorities in a timely manner.</li></ul>"
                    }
                }
            },
            {
                "id": "conflicts",
                "value": 0,
                "locales": {
                    "en": {
                        "title": "Describe a time you faced a challenge with a coworker.",
                        "description": "I tend to get along very well with my coworkers, however sometimes in the quality control process there can be creative differences or style preferences:<ul><li>Once, a coworker quality controlling my work altered certain portions of it not because it was incorrect, but because he felt differently about how it should be presented.</li><li>So I approached him politely and we discussed how we could keep some of my original assessment since I felt it was impactful, while also keeping some of his modifications.</li><li>Result: we were able to put out a report in a timely manner which incorporated both of our preferences, and which the customers were satisfied with.</li></ul>"
                    }
                }
            }
        ],
        "faq-technical": [
            {
                "id": "insurance",
                "value": 0,
                "locales": {
                    "en": {
                        "title": "What is your previous work experience related to insurance?",
                        "description": "Although I might not have as much insurance experience as other applicants, I have done a TON of work in the data analysis space which is applicable to the Product Specialist position, I'm a fast learner!<ul><li>My last job revolved around elaboration, development, review, and maintenance of technical data fed into a data lake by automated processes. This is similar to how you use SAS with SQL Procedures, except using government-specific tools.</li><li>Every day I wrote queries (time-boxed, selector-based) and transformations (dedupe, QC, masking).</li><li>Then I published reports to remotely-monitored dashboards where they would be viewed by customers.</li></ul>"
                    }
                }
            },
            {
                "id": "crm",
                "value": 0,
                "locales": {
                    "en": {
                        "title": "What experience do you have using CRM to manage customer interactions?",
                        "description": "I've used SalesForce CRM in previous jobs, specifically IT contract acquisition for government clients:<ul><li><b>Client Management:</b> In CRM you manage a portfolio of prospective clients, while I used government systems to track the relative potential of targets to yield valuable information.</li><li><b>Adding Notes:</b> In CRM you add relevant notes from customer interactions, the same as keeping tabs on communications. Someone says or does something noteworthy, you need a way to track it and tie it back to the case.</li><li><b>Data Enrichment:</b> CRM integrates with other systems for policy and billing, like the metadata aspect of government reporting systems.</li></ul>"
                    }
                }
            },
            {
                "id": "sas",
                "value": 0,
                "locales": {
                    "en": {
                        "title": "What experience do you have using SAS to generate queries and optimize analytics?",
                        "description": "The custom tools I used in my most recent job were actually pretty similar to SAS:<ul><li><b>Query Generation:</b> SAS allows you to combine prewritten procedures to build and automatically generate queries, which I also have experience doing by other means.</li><li><b>Reusable Queries:</b> SAS reusable procedures also save time on common functions, which is something I did using government systems.</li><li><b>Analytical Tools:</b> Just like this position, I used analytical tools to observe broad trends over time to help cultivate leads and ensure proper coverage.</li></ul>"
                    }
                }
            }
        ]
    }
}