{
    "locales": {
        "en": {
            "title": "Career <span class='text-primary'>Timeline</span>",
            "description": "Here are a few of the ways in which my work has been recognized throughout my career:"
        }
    },

    "subcategories": [
        {
            "id": "certifications",
            "faIcon": "fa-solid fa-award",
            "locales": {
                "en": {"title": "Certifications", "buttonLabel": "View Certification"}
            }
        }
    ],

    "items": {
        "certifications": [
            {
                "id": "oldworldsaints",
                "place": "@link{places.oldworldsaints}",
                "date": "2021/04",
                "href": "https://www.oldworldsaints.com",
                "locales": {
                    "en": {
                        "buttonLabel": "View Website",
                        "title": "Freelance WebApp Designer",
                        "description": "In my free time, I work on various side projects combining my interest in software engineering and world history. During the COVID-19 pandemic, I designed, built, and deployed a Spring Boot Java web application as a concept plan for the former UW Madison Lubar Institute for the Study of the Abrahamic Religions. This site displays information about important figures and commemorations in various traditions through the ancient and medieval world, and showcases my coding approach and attention to detail."
                    }
                }
            },
            {
                "id": "guidewire-cert",
                "place": "@link{places.guidewire}",
                "date": "2021/04",
                "href": "images/places/cert-gw.png",
                "locales": {
                    "en": {
                        "buttonLabel": "View Certification",
                        "title": "Certified PolicyCenter 10.0 Specialist",
                        "description": "To deepen my expertise in the Guidewire suite of insurance software, I pursued and obtained a professional certification in Policy Center configuration. This designation recognizes professionals with a deep understanding of the insurance industry's leading software platform. This required long-term study in order to pass a series of exams evaluating my understanding of the key features of Guidewire software."
                    }
                }
            },
            {
                "id": "safe-cert",
                "place": "@link{places.safe}",
                "date": "2019/10",
                "href": "images/places/cert-safe.png",
                "locales": {
                    "en": {
                        "buttonLabel": "View Certification",
                        "title": "Certified SAFe 4 Scrum Master",
                        "description": "After being asked to step into a more hands-on role in planning and executing on prioritized work within the software development lifecycle, I pursued and obtained a SAFe Scrum Master certification from Scaled Agile, Inc. This designation recognizes expertise in Scrum, Lean, and Agile methodologies by demonstrating knowledge, skills, and experience required to manage Agile projects in a large-scale enterprise through an understanding of SAFe practices. This required enrolling in accredited courses offered by Scaled Agile and passing an exam to assess my ability to apply the principles of the SAFe framework."
                    }
                }
            },
            {
                "id": "sentry",
                "place": "@link{places.sentry}",
                "period": ["2017/05", "Present"],
                "locales": {
                    "en": {
                        "title": "Software Engineer",
                        "description": "<ul><li>Optimized business software systems in a Scaled Agile development ecosystem and tracked work in JIRA as team’s designated Scrum Master.</li><li>Within first year, delivered a bulk data change tool built within Guidewire PolicyCenter which executed with a 99.9% success rate on its inaugural run in production.</li><li>Streamlined build processes to run integrated Jenkins Pipelines and created dynamic environment pooling service to automate deployments to Amazon Web Services.</li><li>Worked in hybrid role with in-person and remote peers on a cross-functional team running queries to support requirements gathering and resolve identified defects.</li><li>Experience working with Amazon Bedrock Large Language Model integrated via API with Docker to harness machine learning for solving difficult business problems.</li></ul>",
                        "tags": ["DevOps", "Java", "Gosu", "AWS", "SQL", "LLM"]
                    }
                }
            },
            {
                "id": "umgc",
                "place": "@link{places.umgc}",
                "period": ["2015/08", "2017/04"],
                "locales": {
                    "en": {
                        "title": "Bachelor of Sciences in Software Development & Security",
                        "description": "<ul><li>Emphasis on vulnerability analysis with coursework in object-oriented, event-driven programming using various development environments and programming languages.</li><li>Experience optimizing relational databases to reduce data redundancy and ensure data integrity.</li><li>Capstone seminar focused on building secure web applications in the context of the software development lifecycle, from design through deployment. </li><li>Graduated summa cum laude (4.0 GPA).</li></ul>",
                        "tags": ["Java", "OOP", "SQL", "Oracle", "RDBMS", "HTML/CSS"]
                    }
                }
            },
            {
                "id": "securityplus",
                "place": "@link{places.securityplus}",
                "date": "2017/03",
                "href": "images/places/cert-securityplus.png",
                "locales": {
                    "en": {
                        "buttonLabel": "View Certification",
                        "title": "Certified Security+",
                        "description": "CompTIA Security+ certification confirms the baseline skills required to perform core security functions, and provides a global benchmark for best practices in IT network and operational security. The certifications requires hands-on practical experience in risk assessment and management, incident response, forensics, enterprise networks, hybrid/cloud operations, and security controls."
                    }
                }
            },
            {
                "id": "networkplus",
                "place": "@link{places.networkplus}",
                "date": "2016/12",
                "href": "images/places/cert-networkplus.png",
                "locales": {
                    "en": {
                        "buttonLabel": "View Certification",
                        "title": "Certified Network+",
                        "description": "CompTIA Network+ certification confirms an individual possesses the skills in networking required to troubleshoot, configure and manage both wired and wireless networks found in companies around the world. The certification requires a professional-level understanding of emerging technologies including cloud and virtualization technologies."
                    }
                },
                "links": [
                    {"faIcon": "fa-brands fa-windows", "href": "https://support.microsoft.com/en-us/office/vlookup-function-0bbc8083-26fe-4963-8ab8-93a18ad188a1", "id": "Microsoft Documentation"}
                ]
            },
            {
                "id": "itfundamentals",
                "place": "@link{places.itfundamentals}",
                "date": "2016/07",
                "href": "images/places/cert-itfundamentals.png",
                "locales": {
                    "en": {
                        "buttonLabel": "View Certification",
                        "title": "Certified IT Fundamentals",
                        "description": "CompTIA IT Fundamentals certification confirms foundational IT knowledge and skills. To earn this certification, individuals must demonstrate an understanding computer hardware and software, basic networking concepts, troubleshooting techniques, cybersecurity awareness, and familiarity with IT terminology."
                    }
                }
            },
            {
                "id": "dod",
                "place": "@link{places.dod}",
                "period": ["2011/08", "2017/03"],
                "locales": {
                    "en": {
                        "title": "Multi-Disciplined Civilian Analyst",
                        "description": "<ul><li>Held Top Secret clearance with periodic background investigation, polygraph, annual financial disclosure, and random drug testing.</li><li>Employed technical and linguistic expertise to identify and assess foreign threats, facilitating the discovery of potential weaknesses in newly-developed software.</li><li>Workplace-sponsored training sessions focused on information assurance, malware analysis, computer networking, digital communications, and governance.</li><li>Gained experience writing Python scripts and executing automation protocols in sandboxed virtual environments running on Red Hat Enterprise Linux.</li><li>Rapidly acquired proficiency in foreign languages and over a dozen specialized tools while mentoring junior team members in these hard-to-teach skill sets.</li></ul>",
                        "tags": ["TS/SCI", "Python", "Pentest", "Linux", "VM", "APT"]
                    }
                }
            },
            {
                "id": "nsep",
                "place": "@link{places.nsep}",
                "date": "2009/08",
                "href": "https://drive.google.com/file/d/1riIw-J_k_e4mXaFR1m8t9mg2uVwfJ5ZT/view?usp=sharing",
                "locales": {
                    "en": {
                        "buttonLabel": "View Fieldwork Project",
                        "title": "Boren Award Recipient - UW College Year in India",
                        "description": "The National Security Education Program (NSEP) fosters a pipeline of foreign language and cultural expertise critical to the U.S. federal government workforce. NSEP was established by the David L. Boren National Security Education Act of 1991 (U.S. Code 50, 90 et seq.). In exchange for funding support, NSEP award recipients agree to work in qualifying national security positions for a minimum of one year.<br><br>The University of Wisconsin's College Year in India program has a history spanning over 50 years, and emphasizes academic rigor and fieldwork. Students participate in immersive language coursework and in-depth research of an approved topic relating the student's major field of study. Students must also complete a 3-month intensive summer language immersion course prior to the start of the program year."
                    }
                }
            },
            {
                "id": "phikappa",
                "place": "@link{places.pkp}",
                "date": "2009/05",
                "href": "images/places/cert-pkp.png",
                "locales": {
                    "en": {
                        "buttonLabel": "View Accolade",
                        "title": "Honor Society Inductee",
                        "description": "Since its founding in 1897, the Honor Society of Phi Kappa Phi has initiated many notable members, including public servants and leaders, Pulitzer and Nobel Prize winners, NASA astronauts and more. It is a global network composed of the best and brightest from all academic disciplines—a community of scholars and professionals building an enduring legacy for future generations. Membership in Phi Kappa Phi is earned through nomination by a local school chapter. Juniors must have completed at least 72 semester hours/108 quarter hours and rank in the top 7.5% of their class."
                    }
                }
            },
            {
                "id": "lubar",
                "place": "@link{places.lubar}",
                "date": "2008/08",
                "href": "https://lubar.wisc.edu/index.html",
                "locales": {
                    "en": {
                        "buttonLabel": "View Website",
                        "title": "Undergraduate Fellow",
                        "description": "The Lubar Institute was founded to create better understanding of the Abrahamic traditions and their interrelationships by encouraging ongoing discussion of these traditions among scholars, members of those traditions, and the general public. The Institute's projects aim to broaden conversations across academic disciplines and faith traditions, between believers and non-believers, and, in upholding the Wisconsin Idea, to bring together campus and community by inviting engagement with the general public."                    
                    }
                }
            },
            {
                "id": "uwmadison",
                "place": "@link{places.uwmadison}",
                "period": ["2007/08", "2010/04"],
                "locales": {
                    "en": {
                        "title": "Bachelor of Arts in Languages & Cultures of Asia",
                        "description": "<ul><li>Emphasis on South Asian studies with coursework in communication, critical thinking, syllogistic and sentential logic, normative ethics, research strategies, and contemporary science issues.</li><li>Participated in 8-week summer intensive language programs equivalent to one full year of study in the target languages (Hindi, Sanskrit).</li><li>Senior thesis on conflict resolution in the context of a 9-month U.S. Government-funded study abroad program in Varanasi, India.</li><li>Graduated magna cum laude (3.8 GPA).</li></ul>",
                        "tags": ["Critical Thinking", "Communication", "Logic", "Ethics", "Research"]
                    }
                }
            }
        ]
    }
}